#1) დაწერე ყველაფერი რაც იცი დარაც დაგამახსოვრდა sequencing, iteration,  selection ტექნიკებთან დაკავშირებით
#2) ახსენი რა არის algorithm


#1
#Sequencing: ნიშნავს, რომ კომპიუტერი გაუშვებს თქვენს კოდს თანმიმდევრობით, თითო სტრიქონზე თქვენი პროგრამის ზემოდან ქვემოდან. ის დაიწყება 1-ლი ხაზიდან, შემდეგ შეასრულებს სტრიქონს 2-ს, შემდეგ 3-ს და ასე შემდეგ, სანამ არ მიაღწევს თქვენი პროგრამის ბოლო ხაზს.
#iteration: ზოგჯერ გსურთ მხოლოდ რამდენიმე სტრიქონის კოდის გაშვება მხოლოდ პირობის დაკმაყოფილების შემთხვევაში, წინააღმდეგ შემთხვევაში გსურთ, რომ კომპიუტერმა უგულებელყო ეს ხაზები და გადახტეს მათზე. ეს მიიღწევა IF განცხადებების გამოყენებით. მაგ. თუ პირობა დაკმაყოფილებულია, მაშინ 4, 5, 6 სტრიქონები შესრულებულია, წინააღმდეგ შემთხვევაში კომპიუტერი გადახტება მე-7 სტრიქონზე 4,5 და 6 სტრიქონების გარეშეც კი.
#selection: ზოგჯერ გსურთ კომპიუტერმა რამდენჯერმე შეასრულოს კოდის ერთი და იგივე ხაზი. ეს კეთდება მარყუჟის გამოყენებით. არსებობს სამი სახის მარყუჟები: მარყუჟებისთვის, ხოლო მარყუჟები და გაიმეორეთ სანამ მარყუჟები. ეს მოსახერხებელია, რადგან საშუალებას გაძლევთ არ დაგჭირდეთ კოდის იგივე სტრიქონების მრავალჯერ კოპირება.


#2
#
